Merge branch 'feat/frontend-ux-enhancements' into feature/ui-timbre
